<template>
  <Part
    title="Согласие на обработку ПД"
    caption="подтвердите своё согласие на обработку нами Ваших персональных данных, указанных в данной форме"
    :icon="icon"
    no-toggle
  >
    <div class="q-pt-sm">
      <q-checkbox v-model="lv.pd">
        Я подтверждаю, что предоставленные мной сведения являются полными и достоверными.
      </q-checkbox>
      <q-separator />
      <q-checkbox v-model="lv.s">
        Даю своё согласие на обработку персональных данных
      </q-checkbox>
      <q-btn flat @click="alert = true" class="q-pl-sm text-primary">прочитать соглашение</q-btn>
    </div>

    <q-dialog v-model="alert">
      <q-card>
        <q-card-section>
          <div class="text-h6">Согласие на обработку персональных данных</div>
        </q-card-section>
        <q-separator />
        <q-card-section style="max-height: 50vh" class="scroll">
          <p>
            Настоящим во исполнение требований Федерального закона «О персональных данных» No 152-ФЗ от 27.07.2006 г.
            я (Ф.И.О: {{ fullname }}, паспорт: {{ s }} {{ n }} выдан {{ w }}, адрес регистрации: {{ a }})
            даю свое согласие Обществу с ограниченной ответственностью «ТелеТайм»
            (место нахождения: 352120, Краснодарский край, г.Тихорецк, ул.Энгельса, д.109/1),
            а также его аффилированным, зависимым и дочерним компаниям и организациям,
            а также обособленным подразделениям на обработку моих персональных данных
            в целях формирования кадрового документооборота предприятия,
            а также на хранение всех вышеназванных данных на электронных носителях.
          </p>
          <p>
            Настоящее согласие не устанавливает предельных сроков обработки данных.
            До моего сведения доведено, что под обработкой персональных данных подразумевается
            сбор, систематизацию, накопление, хранение, уточнение (обновление, изменение),
            использование, распространение (в том числе передачу), обезличивание, блокирование,
            уничтожение и любые другие действия (операции) с персональными данными.
          </p>
          <p>
            Также под персональными данными подразумевается любая информация,
            имеющая ко мне отношение как к субъекту персональных данных, в том числе моя
            фамилия, имя, отчество, дата и место рождения, адрес проживания и любая другая информация.
          </p>
          <p>
            Порядок отзыва согласия на обработку персональных данных мне известен.
            Подтверждаю, что, давая согласие, я действую без принуждения, по собственной воле и в своих интересах.
          </p>
        </q-card-section>

        <q-separator />

        <q-card-actions align="right">
          <q-btn flat label="понятно" color="primary" class="full-width" v-close-popup />
        </q-card-actions>
      </q-card>
    </q-dialog>

  </Part>
</template>
<script>

import Part from './part'
export default {
  name: 'DPA',
  components: { Part },
  props: ['icon', 'fullname', 's', 'n', 'w', 'a', 'value'],
  data () { return { alert: false } },
  computed: { lv: { get () { return this.value }, set (v) { this.$emit('input', v) } } }
}
</script>
